<template>
  <view class="content">
    <view>
      <text class="tipsTitle">典型项目介绍</text>
    </view>
    <el-collapse v-model="activeName" accordion class="v-collapse">
      <el-collapse-item title="水雨情智慧查询系统-项目金额(100w)" name="1">
        <div>职务担当：前端WEB开发工程</div>
        <br />
        <div>
          主要职责：
          <br />1.负责项目整体从Jquery到VUE技术的迁移工作
          <br />2.负责前端组件的封装
          <br />3.在过往项目中发现并优化功能及用户体验
          <br />4.识别过往功能中可能存在的风险问题并提交至上级处
        </div>
        <br />
        <div>
          项目介绍：
          <br />项目主要为辽宁省范围内的测站系统提供数据水雨情以及塘情的分析，预警，预报功能，同时为了方便特定用户的使用，后续添加进入了数据的个性化导出打印功能以及会商使用，立志打造一整套的水雨情现代信息化工程。
        </div>
        <br />
        <div>
          前端主要使用技术：
          <br />项目使用 VUE+Layer+BootStrap
          为主要技术栈进行历史页面维护及新功能开发工作。
        </div>
        <br />
        <div>
          主要业绩：
          <br />1.使用 Vuex 实现组件解耦。 <br />2.封装 Axios
          为项目前后端通讯提供便利并针对后端不同的逻辑对传输数据格式进行分类处理。
          <br />3.封装 Echarts 使得项目整体中同类别的图表利于维护。
          <br />4.在项目数据交互部分中为后端同事提供方便合理的数据结构方案。
          <br />5.接手整体项目并负责维护以及优化项目后续功能方案。
          <br />6.重构历史页面以使得系统维护性变强。 <br />7.整理公司原本的地图
          API 并形成解释文档，方便后续员工使用。
        </div>
      </el-collapse-item>
      <el-collapse-item title="掌起智能化平台-持续研发性项目（VUE3项目）" name="2">
        <div>职务担当：前端WEB开发工程师</div>
        <br />
        <div>
          主要职责：
          <br />1.负责公司内部低代码平台0-1的开发工作 <br />2.负责搭设前端基础架构
          <br />3.负责封装项目通用组件及系统组件方法的使用文档
          <br />4.负责搭建项目核心功能模块
          <br />5.负责优化用户体验
        </div>
        <br />
        <div>
          项目介绍：
          <br />项目为公司为开拓实验室配方市场推动的一项以低代码+AI智能化搭配使用的系统。
          <br />公司产品介绍网址：<a href="https://dim.holdingfuture.com/HF-WMS/">https://dim.holdingfuture.com/HF-WMS/</a>
          <br />项目网址：<a href="https://plm.holdingfuture.com/login">https://plm.holdingfuture.com/login</a>
        </div>
        <br />
        <div>
          前端主要使用技术：
          <br />项目前端采用 VUE3 全家桶+Element，Echarts，Luckysheet，sortable.js 进行开发。
        </div>
        <br />
        <div>
          主要业绩：
          <br />1.成功将低代码平台从零开发到上线，平台功能全面、性能稳定，得到了用户的高度评价和广泛使用。
          <br />2.通过低代码平台的实施，核心通用组件的封装，便捷的组件使用文档书写，大幅提升了应用开发的效率，降低了开发成本，优化了公司内部的开发流程。
          <br />3.平台的灵活性和易用性得到了用户的好评，平台在实际应用中表现出色，成为公司内部和外部项目的重要工具。
        </div>
      </el-collapse-item>
      <el-collapse-item title="水库调度系统-项目金额(45w)" name="3">
        <div>职务担当：前端WEB开发工程师及项目经理</div>
        <br />
        <div>
          主要职责：
          <br />1.负责项目核心逻辑的整理 <br />2.负责前端核心组件的封装
          <br />3.负责项目整体的设计，用户体验，需求分析
          <br />4.负责项目推进及项目风险，问题的识别与解决
          <br />5.负责项目的整体整改工作，保证项目顺利验收
        </div>
        <br />
        <div>
          项目介绍：
          <br />项目目标旨在通过信息化技术整合区域内百万级别的相关数据进行处理，并通过相关算法进行数据处理以得到相关预测数据，进而进行水库水量预警及调度功能，以预防干早及决堤等相关问题。
        </div>
        <br />
        <div>
          前端主要使用技术：
          <br />项目前端采用 VUE 全家桶+Element，Echarts 框架进行开发，封装
          Leafletjs 以实现地图功能，并采用 Flvjs 实现直播以及视频回放功能。
        </div>
        <br />
        <div>
          主要业绩：
          <br />1.此项目由于历史原因无法通过验收，需要对项目进行重新改造。因此在有限的时间内本人对项目整体进行了重新的梳理，保留了必要的部分，对项目进行重构，最终在2个月内对项目完成了重新开发的工作，除针对客户重点功能进行功能重构开发外，还提升了项目整体的用户操作体验，最终完成了项目验收工作。
          <br />2.重新修复了客户关系，将客户关系从不信任提升至信任，并维持了客户继续合作的意愿。
          <br />3.除开项目整体设计管理部分，并在此项目开发部分主要负责系统前端部分的开发，从组件封装到核心业务逻辑处理布设完全，保证了系统各类功能的复用性同时提升针对客户使用习惯进行特例开发优化工作。
        </div>
      </el-collapse-item>
      <el-collapse-item title="水库调度系统-项目金额(45w)" name="4">
        <div>职务担当：前端WEB开发工程师及项目经理</div>
        <br />
        <div>
          主要职责：
          <br />1.负责项目核心逻辑的整理 <br />2.负责前端核心组件的封装
          <br />3.负责项目整体的设计，用户体验，需求分析
          <br />4.负责项目推进及项目风险，问题的识别与解决
          <br />5.负责项目的整体整改工作，保证项目顺利验收
        </div>
        <br />
        <div>
          项目介绍：
          <br />项目目标旨在通过信息化技术整合区域内百万级别的相关数据进行处理，并通过相关算法进行数据处理以得到相关预测数据，进而进行水库水量预警及调度功能，以预防干早及决堤等相关问题。
        </div>
        <br />
        <div>
          前端主要使用技术：
          <br />项目前端采用 VUE 全家桶+Element，Echarts 框架进行开发，封装
          Leafletjs 以实现地图功能，并采用 Flvjs 实现直播以及视频回放功能。
        </div>
        <br />
        <div>
          主要业绩：
          <br />1.此项目由于历史原因无法通过验收，需要对项目进行重新改造。因此在有限的时间内本人对项目整体进行了重新的梳理，保留了必要的部分，对项目进行重构，最终在2个月内对项目完成了重新开发的工作，除针对客户重点功能进行功能重构开发外，还提升了项目整体的用户操作体验，最终完成了项目验收工作。
          <br />2.重新修复了客户关系，将客户关系从不信任提升至信任，并维持了客户继续合作的意愿。
          <br />3.除开项目整体设计管理部分，并在此项目开发部分主要负责系统前端部分的开发，从组件封装到核心业务逻辑处理布设完全，保证了系统各类功能的复用性同时提升针对客户使用习惯进行特例开发优化工作。
        </div>
      </el-collapse-item>
      <el-collapse-item title="航标运行管理系统-项目金额(30w)" name="5">
        <div>职务担当：前端WEB开发工程师及项目经理</div>
        <br />
        <div>
          主要职责：
          <br />1.负责项目核心逻辑的整理 <br />2.负责前端核心组件的封装
          <br />3.负责项目整体的设计，用户体验，需求分析
          <br />4.负责项目推进及项目风险，问题的识别与解决
          <br />5.负责项目的运维优化工作，解决日常用户在使用中出现的各类问题
        </div>
        <br />
        <div>
          项目介绍：
          <br />项目主要为对航海要素进行观测、分析并加以信息化处理，通过可视化处理供以客户使用，目的在于以信息化的手段提升客户的日常工作的效率，对沿海自然灾害的预测，检测，最终达到减少人员及财务损失的目的。
          此项目分为每年一期的需求功能新增以及历史功能页面的维护，
          在此项目中需要兼顾开发，运营，维护三项工作。
        </div>
        <br />
        <div>
          前端主要使用技术：
          <br />项目前端使用 Vue 全家桶+Elememt 为主要前端开发技术内容，兼容过往
          JS+BootStrap+Layer 的历史页面架构进行开发维护。
        </div>
        <br />
        <div>
          主要业绩：
          <br />1.完成了项目的日常运营维护工作，合理利用数据分析手段，整合台风期客户方50+的问题反馈，最终统一处理，解决了客户的问题同时也降低了我方人员的成本损耗。
          <br />2.由于良好的处理以及对历史功能的用户体验优化，得到了客户方的好评并顺利签订下一期的开发及维护合同。
          <br />3.对新功能的开发需求把握准确，并积极对客户进行调研，最终提交出符合用户操作习惯的系统，获得用户的好评。
        </div>
      </el-collapse-item>
      <el-collapse-item title="数字工坊产教融合系统-项目金额(45w)" name="6">
        <div>职务担当：前端WEB开发工程师及项目经理</div>
        <br />
        <div>
          主要职责：
          <br />1.负责与外包方进行沟通推进项目的修改与优化
          <br />2.对业务逻辑不符合常理及功能需要优化的部分产出相应的技术及解决文档
          <br />3.负责项目整体的设计，用户体验，需求分析
          <br />4.负责项目推进及项目风险，问题的识别与解决
        </div>
        <br />
        <div>
          项目介绍：
          <br />本项目开发目的为实现学校教育与企业日常工作的深度结合，希望通过系统的建立，保证学生从学校中即可学习到企业的工作模式，保证毕业生与社会的契合度。
        </div>
        <br />
        <div>
          前端主要使用技术：
          <br />项目主要使用了 VUE+Element 进行开发。
        </div>
        <br />
        <div>
          主要业绩：
          <br />1.将有问题，难用，不可交付的系统进行整改，最终推进项目到达终验。
          <br />2.以自身的经验与能力发现系统中的问题部分，并产出需求变动文档，与乙方沟通，最终以合理的变动需求配合乙方完成项目整改工作。
          <br />3.以自身的经验与能力对系统中复杂的逻辑部分进行整改，修复系统中过往不合理的逻辑并产出相应的需求文档，最终使得系统的使用逻辑清晰，降低用户使用难度，变相提升了用户体验，得到用户好评。
        </div>
      </el-collapse-item>
      <el-collapse-item title="京东物流后台管理系统" name="7">
        <div>职务担当：前端WEB开发工程师</div>
        <br />
        <div>
          主要职责：
          <br />1.负责对设计师产出的页面进行像素级复现 <br />2.负责完成项目功能
        </div>
        <br />
        <div>
          项目介绍：
          <br />本项目主要实现对车辆的实时监控，并生成 kpi
          报表，且使得各项数据的可视化显示，并附带部分页面及功能的大屏数据展示，以利于工作人员对整体物流信息进行高效率的管理。
        </div>
        <br />
        <div>
          前端主要使用技术：
          <br />项目主要使用 VUE+IVIEW+Echarts进行开发。
        </div>
        <br />
        <div>
          主要业绩：
          <br />1.负责对项目过往的代码进行维护，解决项目中出现以及遗留下的问题。
          <br />2. 解决页面自适应的问题
          解决了对后端传来的大量无分类不可用数据处理的问题。 <br />3.
          对页面功能开始进行组件化开发。 <br />4.
          处理项目中出现的技术问题及对出现的 bug 进行修复。
        </div>
      </el-collapse-item>
    </el-collapse>
  </view>
</template>

<script>
export default {
  data() {
    return {
      title: "Hello",
      activeName: "1",
    };
  },
  onLoad() {},
  methods: {},
};
</script>

<style>
.content {
  /* display: flex; */
  width: 100%;
  padding: 10px;
  /* flex-direction: column;
  align-items: center;
  justify-content: center; */
}
.v-collapse {
  width: 90%;
}
.tipsTitle {
  display: flex;
  justify-content: center;
  align-items: center;
  height: 50px;
  width: 100%;
  text-align: center;
  font-size: 46rpx;
  color: black;
}
.logo {
  height: 200rpx;
  width: 200rpx;
  margin: 200rpx auto 50rpx auto;
}

.text-area {
  display: flex;
  justify-content: center;
}

.title {
  font-size: 36rpx;
  color: #8f8f94;
}
</style>
